#+TITLE: DM1 Week 02 Ponder/Prove
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t d:(not "HINT")
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup

[[elisp:(find-file-other-window%20"../week00/00-prepare.org")][Read Instructions]]
[[elisp:(browse-url-of-file%20(org-html-export-to-html))][Export to HTML and Browse]]
[[elisp:(org-clock-report%201)][Insert/Update Clock Summary Report]]
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2018-05-12 Sat 20:00]
| Headline     | Time   |      |
|--------------+--------+------|
| *Total time* | *2:23* |      |
|--------------+--------+------|
| Exercises    | 2:23   |      |
| \_  TDR      |        | 0:18 |
| \_  WDT      |        | 0:24 |
| \_  TEJ      |        | 0:50 |
| \_  WFK      |        | 0:24 |
| \_  TER      |        | 0:23 |
| \_  TGE      |        | 0:04 |
#+END:



#+BEGIN_SRC elisp 
  (defun comit-git ()
    (vc-next-action (read-from-minibuffer "Enter a commit message: "))) 
  (comit-git)
#+END_SRC

#+RESULTS:
: Enter a change comment.  Type C-c C-c when done

* Exercises
** DONE TDR
   CLOSED: [2018-05-12 Sat 12:51]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 12:33]--[2018-05-12 Sat 12:51] =>  0:18
   :END:
#+begin_note
  Find the =setf= way of doing the equivalent of =fset=.
#+end_note
#+BEGIN_SRC elisp
  
  (defun dooo (n)
     (+ n 2))
  (fset 'doo (lambda (n) (+ n 2)))
  (setf doooo (lambda (n) (+ n 2)))

  (list
    (list (dooo 6))
    (list (doo 6))
    (list (funcall doooo 6))
  )
#+END_SRC

#+RESULTS:
| 8 |
| 8 |
| 8 |


#+begin_info
  Creating a method suing  setf is almost identical to creating 
  a method using fset.

  The two differences are that fset requires a single quote before 
  the function name and in order to call a function defined by setf
  you must use the "funcall" method.

#+end_info
** DONE WDT
   CLOSED: [2018-05-12 Sat 17:14]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 13:35]--[2018-05-12 Sat 13:59] =>  0:24
   :END:
#+begin_note
  PVP the result of evaluating the following (paying special attention to the
  more-than-syntactic difference between the \lsquo{}starless\rsquo{} form of =let= and the
  \lsquo{}star-suffixed\rsquo{} form):

  PVP - Predict Verify Ponder
#+end_note

*** Problem 1
**** Predict
use a for 1,
b for 2,
c for 3

then add a, b, and c
answer = 6
**** Verify
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) (+ a b c))
#+END_SRC

#+RESULTS:
: 6

My assumption was correct
**** Ponder
(let) allows a use to say
"given that a=1... n=10... then do ____"

*** Problem 2
**** Predict
let a be 1,
b be 2
c be 3

then add a, b, c, and d

This code block will not evaluate,
or it will add the ascii value of d
to a, b, and c
**** Verify
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) (+ a b c d))
#+END_SRC

the function did not evalute. It said
the symblos value as variable is void
**** Ponder
If we changed d to be ?d ti might evaluate with
the asscii calue of d
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) (+ a b c ?d))
#+END_SRC

#+RESULTS:
: 106

It did evalute this way!
     
*** Problem 3
**** Predict
a = 1,
b = 2,
c = 3,

this will try to make a vector
it will contain: +, 1, 2, 3, d
**** Verify
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ a b c d])
#+END_SRC

#+RESULTS:
: [+ a b c d]

I was wrong, a,b, and c did not evalute to the
values set by let.

**** Ponder
Maybe if a I did 'a and so forth, then it 
would work as i previously expected
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ 'a 'b 'c d])
#+END_SRC

#+RESULTS:
: [+ (quote a) (quote b) (quote c) d]
Nope... Maybe if I put parentheses around the leters
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ (a) (b) (c) d])
#+END_SRC

#+RESULTS:
: [+ (a) (b) (c) d]
Nope... Maybe if I put a question mark before the leters
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ ?a ?b ?c d])
#+END_SRC

#+RESULTS:
: [+ 97 98 99 d]
Nope... I found this idea online
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ (symbol-value a) (symbol-value b) (symbol-value c) d])
#+END_SRC

#+RESULTS:
: [+ (symbol-value a) (symbol-value b) (symbol-value c) d]

Nope... maybe evaluation inside a vector just
doesn't work... but can I grab the value of 'a'
from the vector ?
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) (aref [+ a b c d] 2))
#+END_SRC

#+RESULTS:
: b

Nope... something else I found online
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ a-val b-val c-val d])
#+END_SRC

#+RESULTS:
: [+ a-val b-val c-val d]

Nope... something else I found online
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3)) [+ ,a ,b ,c d])
#+END_SRC

#+RESULTS:
: [+ (\, a) (\, b) (\, c) d]

Nope... something else I found online - trying to convert to list first
#+BEGIN_SRC emacs-lisp
  (symbol-value (let ((a 1) (b 2) (c 3)) (elt (append [+ a b c d] nil) 1)))
#+END_SRC

#+RESULTS:
: a

Nope, I guess it is an impossibilty, at least with my current knowledge
of things as they are.

*** Problem 4
**** Predict
a = 1,
b = 2,
c = 3,
+ = 4?

this block of code will not evalute correctly 
vecause of the + at the end
**** Verify
#+BEGIN_SRC emacs-lisp
  (let ((a 1) (b 2) (c 3) (+ 4)) (+ a b c +))
#+END_SRC

#+RESULTS:
: 10
I was wrong.

**** Ponder
we defined the the sybmol-value of + to be 4

*** Problem 5
**** Predict
make a unbound - remove previous value of a?
               - make a have infinite scope?
a = 1,
b = 2,
c = 3,
d = 5,

add a, b, c, and d together
**** Verify
#+BEGIN_SRC emacs-lisp
  (makunbound 'a)
  (let ((a 1) (b 2) (c 3) (d (+ a 4))) (+ a b c d))
#+END_SRC
I was wrong 
 - Sybmol's value as variable is void: a
Or I just did not understand all of it.

**** Ponder
(makunbound) does clear the previous value,
but we cannot use 'a' inside of the bindings 
for the (let) method in order to define 
another variable.
#+BEGIN_SRC emacs-lisp
  (makunbound 'a)
  (setq a 1)
  (let ((a 1) (b 2) (c 3) (d (+ a 4))) (+ a b c d))
#+END_SRC

#+RESULTS:
: 11

*** Problem 6
**** Predict
I predict this special definition of
let will allow it's previous bindings 
to be used in the deffinitions of it's
other bindings
**** Verify
#+BEGIN_SRC emacs-lisp
  (let* ((a 1) (b 2) (c 3) (d (+ a 4))) (+ a b c d))
#+END_SRC

#+RESULTS:
: 11
I was correct!

**** Ponder
let* must work as i expected it to

** DONE TEJ
   CLOSED: [2018-05-12 Sat 18:06]
  :LOGBOOK:
  CLOCK: [2018-05-12 Sat 17:16]--[2018-05-12 Sat 18:06] =>  0:50
  :END:
#+begin_note
  A function-as-association between elements of a domain and elements of a
  codomain, for \ldquo{}small\rdquo domains and codomains, inspired so-called \ldquo{}association
  lists\rdquo (or alists) and the =assoc= (and associated) functions.

  =(assoc KEY LIST)= returns non-nil if KEY is \ldquo{}equal\rdquo to the first element of
  an element of LIST. The value is actually the first element of LIST whose
  first element equals KEY.
  
  For example, here is a function that uses an alist to look up the RGB values
  of a given color name:

#+BEGIN_SRC emacs-lisp :results silent
  (defun lookup-rgb (color-name)
    (rest (assoc color-name
                 '(("red" 255 0 0) ("green" 0 255 0) ("blue" 0 0 255)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
  (lookup-rgb "blue")
#+END_SRC

#+RESULTS:
(0 0 255)

: (0 0 255)

  What if the color name is not in the alist?

#+BEGIN_SRC emacs-lisp :results raw
  (lookup-rgb "grue")
#+END_SRC

#+RESULTS:
nil

: nil

  There are several variations of =assoc=. Find and give examples of using them.
#+end_note

#+begin_info
assoc-if 
#+BEGIN_SRC elisp :results raw
  (setq animals '(("dogs" bark) ("cats" meow) ("snakes" hiss)))
  (cdr (assoc-if #'(lambda (x) (string= "dogs" x)) animals))
#+END_SRC

#+RESULTS:
(bark)

assoc-if-not
#+BEGIN_SRC elisp :results raw
  (setq animals '(("dogs" bark) ("cats" meow) ("snakes" hiss)))
  (car (assoc-if-not #'(lambda (x) (string= "dogs" x)) animals))
#+END_SRC

#+RESULTS:
cats

assq - variation of assoc, but does 
not work if keys are "like this"
#+BEGIN_SRC elisp
  (setq animals '((dogs . bark) (cats . meow) (snakes . hiss)))
  (cdr (assq 'dogs animals))
#+END_SRC

#+RESULTS:
: bark

rassq - variation that uses 
the "value" to do a look up 
rather than the "key"
#+BEGIN_SRC elisp
  (setq animals '((dogs . bark) (cats . meow) (snakes . hiss)))
  (car (rassq 'bark animals))
#+END_SRC

#+RESULTS:
: dogs

rassoc - variation that uses 
the "value" to do a look up 
rather than the "key"
#+BEGIN_SRC elisp
  (setq animals '((dogs . bark) (cats . meow) (snakes . hiss)))
  (car (rassoc 'bark animals))
#+END_SRC

#+RESULTS:
: dogs

#+end_info
** DONE WFK
   CLOSED: [2018-05-12 Sat 18:29]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 18:05]--[2018-05-12 Sat 18:29] =>  0:24
   :END:
#+begin_note
  In the function-as-map context, here is another interpretation:

  A \ldquo{}map\rdquo type (AKA associative array, AKA hashtable) is found in many
  languages. For example, C++:
#+BEGIN_SRC C++ :results output
  #include <iostream>
  #include <map>
  using namespace std;

  int main() {
     map<string, string> mymap;

     mymap["one"] = "red";
     mymap["two"] = "blue";
     mymap["three"] = "green";

     for (auto const &ent1 : mymap) {
        cout << ent1.first << " : " << ent1.second << endl;
     }
  }
#+END_SRC

#+RESULTS:
: one : red
: three : green
: two : blue

: one : red
: three : green
: two : blue

  And python:
#+BEGIN_SRC python :results output
  mymap = {}

  mymap["one"] = "red"
  mymap["two"] = "blue"
  mymap["three"] = "green"

  if __name__ == "__main__":
          for key in mymap.keys():
                  print( key + " : " + str(mymap[key]))
#+END_SRC

#+RESULTS:
: one : red
: two : blue
: three : green

: three : green
: two : blue
: one : red

  And of course elisp:
#+BEGIN_SRC emacs-lisp :results output
  (let* ((mymap (make-hash-table :test 'equal)))
    (puthash "one" "red" mymap)
    (puthash "two" "blue" mymap)
    (puthash "three" "green" mymap)
    (pp (list (gethash "one" mymap)
              (gethash "two" mymap)
              (gethash "three" mymap)))
    (maphash (lambda (key value) (princ (format "%s : %s\n" key value))) mymap))
#+END_SRC

#+RESULTS:
: ("red" "blue" "green")
: one : red
: two : blue
: three : green

: ("red" "blue" "green")
: one : red
: two : blue
: three : green

  What happens if you omit the =:test 'equal= parameters to the
  =make-hash-table= call?
#+end_note
#+begin_info
Without the ":test 'equal" parameter 
the "heading" displayed results in
a list of nil
#+BEGIN_SRC emacs-lisp :results output
  (let* ((mymap (make-hash-table)))
    (puthash "one" "red" mymap)
    (puthash "two" "blue" mymap)
    (puthash "three" "green" mymap)
    (pp (list (gethash "one" mymap)
              (gethash "two" mymap)
              (gethash "three" mymap)))
    (maphash (lambda (key value) (princ (format "%s : %s\n" key value))) mymap))
#+END_SRC

#+RESULTS:
: (nil nil nil)
: one : red
: two : blue
: three : green

#+end_info
** DONE TER
   CLOSED: [2018-05-12 Sat 18:54]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 18:30]--[2018-05-12 Sat 18:53] =>  0:23
   :END:
#+begin_note
  This exercise explores /looping/ versus /mapping/.

  What does the =morphify= function defined below do? Think about it, then PVP
  the result of the call to it that follows.

#+BEGIN_SRC emacs-lisp :results silent
  (defun morphify (fun lst)
    (loop for item in lst
          collect (funcall fun item)))
#+END_SRC

  Note the quotes:

#+BEGIN_SRC emacs-lisp :results raw
  (morphify (quote downcase) (quote ("THIS" "IS" "TOO" "LOUD")))
#+END_SRC

  The =morphify= function is essentially a /mapping/ function, which means it
  takes a passed-in function (=fun=) and a passed-in list (=lst=), and /maps fun
  over lst/, i.e., the results of calling the function =fun= on each element of
  the list =lst= are collected into a new list, which is returned.

  This shows one way (iteratively) a /map/ function could be implemented.
  Another way is /recursively/, as in:

#+BEGIN_SRC emacs-lisp :results silent
  (defun morphifyr (fun lst)
    (if (null lst)
        nil
      (append (list (funcall fun (first lst))) (morphifyr fun (rest lst)))))
#+END_SRC

  Explain how this version of =morphify= works.
#+end_note
#+begin_info
 - Predict ::
    this function takes in a list of lists and
    collects the different parts of it into a
    new "morphed" list.
 - Verify ::
    #+BEGIN_SRC emacs-lisp :results silent
      (defun morphify (fun lst)
        (loop for item in lst
              collect (funcall fun item)))
    #+END_SRC
    
    #+BEGIN_SRC emacs-lisp :results raw
      (morphify (quote downcase) (quote ("THIS" "IS" "TOO" "LOUD")))
    #+END_SRC

    #+RESULTS:
    (this is too loud)

   This did not at all do what I thought it would
   I think I should have studied it more
   thouroughly.
 - Ponder ::
   After looking through the begining of the note, and looking
   more carefully at the code, i can now see that morphify is meant
   to perform a single action on larger sets of data.
 - Recursive Version :: 
      The recursive version takes in a funtion and 
      a list still, but instead of doing a loop 
      through each item in the list, it looks to
      see if the list is null, then then it morfs 
      the first item, and appends that item with 
      the morphed version of the rest of the list

      example:
      morphify downcase (THIS IS ALL I WANT)
      morphify does this first
      "this" then appends it with 
      morphify downcase (IS ALL I WANT)
      then the recusively called function does this
      "is" then appends it with
      morphify downcase (ALL I WANT)

      this contines untill the whole list has been gone through
      once it has this happens
      "want" is appended to "i"
      "i want" is appended to "all"
      "all i want" is appended to "is"
      and finally
      "is all i want" is appended to "this"
      to produce
      this is all i want

#+end_info
** DONE TGE
   CLOSED: [2018-05-12 Sat 18:58]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 18:54]--[2018-05-12 Sat 18:58] =>  0:04
   :END:
#+begin_note
  Note the difference if -13 is used instead of 13 below:
#+BEGIN_SRC emacs-lisp :results silent
  (defun compute-floor-the-hard-way (dividend divisor)
    (- (/ dividend (float divisor)) (/ (mod dividend divisor) (float divisor))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((number (/ -13 4.0))
         (floor1 (floor number))
         (floor2 (compute-floor-the-hard-way -13 4.0)))
    (list number floor1 floor2))
#+END_SRC

#+RESULTS:
(-3.25 -4 -4.0)
(3.25 3 3.0)

: (3.25 3 3.0)

  Is the hard way correct?
#+end_note
#+begin_info
  The hard way does produce the same values as the 
  floor method.
#+end_info
** TODO THP
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 19:00]--[2018-05-12 Sat 20:07] =>  1:07
   :END:
#+begin_note
  Graph the floor and ceiling functions f(x) = \lfloor{}x\rfloor and f(x) = \lceil{}x\rceil for real
  number values of x in the interval [-5.0 .. 5.0].
#+end_note
#+begin_info

#+end_info
** DONE WKM
   CLOSED: [2018-05-12 Sat 20:23]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 20:11]--[2018-05-12 Sat 20:22] =>  0:11
   :END:
#+begin_note
  Which of these statements about floor and ceiling are correct, for any real
  number $x$ and any integers $n$ and $m$?
  1. $x - 1 < \lfloor{}x\rfloor \le x \le \lceil{}x\rceil < x + 1$.
  2. $\lfloor{}-x\rfloor = -\lceil{}x\rceil$.
  3. $\lceil{}-x\rceil = -\lfloor{}x\rfloor$.
  4. $\lfloor{}x + n\rfloor = \lfloor{}x\rfloor + n$.
  5. $\lceil{}x + n\rceil = \lceil{}x\rceil + n$.
  6. $\lfloor{}\frac{n}{2}\rfloor + \lceil{}\frac{n}{2}\rceil = n$.
  7. $\lfloor{}\frac{n}{2}\rfloor + \lfloor{}\frac{n + 1}{2}\rfloor = n$.
  8. $\lceil{}\frac{n}{2}\rceil + \lceil{}\frac{n + 1}{2}\rceil = n$.
  9. $\lfloor{}\frac{n + m}{2}\rfloor + \lceil{}\frac{n - m + 1}{2}\rceil = n$ (for any $m$, not just $m =
     0$ as in statement 7).
  10. $\lceil{}\frac{n + m}{2}\rceil + \lceil{}\frac{n - m + 1}{2}\rceil = n$ (for any $m$, not just $m =
      0$ as in statement 8).
#+end_note
#+begin_info
  1. t
  2. nil
  3. nil
  4. t
  5. t
  6. t
  7. t
  8. nil
  9. t
  10. nil
#+end_info
** DONE TIW
   CLOSED: [2018-05-12 Sat 20:40]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 20:30]--[2018-05-12 Sat 20:40] =>  0:10
   :END:
#+begin_note
  Define the function \ldquo{}round to nearest integer\rdquo using the floor and ceiling
  functions, together with the \ldquo{}Iverson bracket\rdquo function. (A number whose
  fractional part is less than one-half should be rounded down, otherwise up.)
#+end_note
#+begin_info
Iverson bracket function - true or false
     aka: if statement
     it works really well.
#+BEGIN_SRC elisp :results silent
  (defun round-to-nearest-int (x)
    (if (< (- x (floor x)) .5)
      (floor x)
      (ceiling x)))
#+END_SRC

#+BEGIN_SRC elisp
  (round-to-nearest-int 3.5)
#+END_SRC

#+RESULTS:
: 4

#+end_info
** DONE TKG
   CLOSED: [2018-05-12 Sat 20:50]
   :LOGBOOK:
   CLOCK: [2018-05-12 Sat 20:45]--[2018-05-12 Sat 20:50] =>  0:05
   :END:
#+begin_note
  Explore the inverse of =assoc= via the functions =rassoc= and associates.
#+end_note
#+begin_info
#+BEGIN_SRC elisp
  (setq mylist '((one . 1) (2 . two) (3 . "three")))
  (list
    (rassoc 'two mylist)
    (rassoc-if #'stringp mylist)
    (rassoc-if-not #'vectorp mylist)
  )
#+END_SRC

#+RESULTS:
: ((2 . two) (3 . three) (one . 1))

#+end_info
** TODO WOV
#+begin_note
  Identify the formula or rule that generates the terms of each sequence:
  1. =[7 14 21 28 35 42 49 56 63 70 ...]=
  2. =[7 11 15 19 23 27 31 35 39 43 ...]=
  3. =[3 4 6 9 13 18 24 31 39 48 ...]=
  4. =[1 10 11 100 101 110 111 1000 1001 1010 ...]=
  5. =[1 1 2 3 5 8 13 21 34 55 ...]=
  6. =[7 22 11 34 17 52 26 13 40 20 ...]=
  7. =[2 1 3 4 7 11 18 29 47 76 ...]=
  8. =[6 12 24 48 96 192 384 768 1536 3072 ...]=
  9. =[6 18 54 162 486 1458 4374 13122 39366 118098 ...]=
  10. =[2 3 5 7 11 13 17 19 23 29 ...]=
#+end_note
#+begin_info
  1. add 7 times it's position (7 * n) n starts at 1
  2. add four to the previous number starting at 7
     7 + (4 * (n - 1)) n starting at 1
  3. n_-1 + n where n_-1 starts at 3
  4. 
#+end_info
** TODO WQW
#+begin_note
  Classify the following lisp functions according as each is or is not a predicate:
  | Predicate? | Yes or No? |
  |------------+------------|
  | =list=     |            |
  | =listp=    |            |
  | =integerp= |            |
  | =vector=   |            |
  | =vectorp=  |            |
  | =symbolp=  |            |
  | =zerop=    |            |
  | =evenp=    |            |
  | =oddp=     |            |
#+end_note
#+begin_info
  Your answer goes here. (Replicate the above table.)
#+end_info
* Problems
  Note: * means optional. If it\rsquo{}s not starred, it\rsquo{}s required.
** TODO TBD *
#+begin_note
  A function is one-to-one if and only if it is onto, /provided/ its domain and
  codomain are the same size.

  Put this statement in symbolic form using the adjectives /injective/ and
  /surjective/, and argue for its truth using the following formal definitions:

  A function from domain A to codomain B

  f : A \rarr B

  is
  - injective :: if f(m) \ne f(n) whenever m \ne n, for all m \in A and for all n \in A;

  and/or is
  - surjective :: if for all b \in B there exists an a \in A such that f(a) = b.
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WDK *
#+begin_note
  Venture further into the /quote/ \ldquo{}macro\rdquo in lisp, used to \ldquo{}suppress\rdquo
  evaluation of symbols, lists and other things. Explore the difference between
  /set/, /setq/ and /setf/ --- /setf/ being another Common Lisp macro (hence the
  need to =(require 'cl)=, as with =loop=) --- and note which feature of
  functional programming is being flouted in this code:

#+BEGIN_SRC emacs-lisp
  (require 'cl)

  (set 'a 'one)
  (setq a (quote one))
  (setf b '(one two))
  (setf a (first b))
  (setf (second b) a)
#+END_SRC
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO TEH
  Important: see Exercise WDT for context.
#+begin_note
  Could you get by without this star-suffixed form? How?
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WFC
#+begin_note
  Remembering that these are functions, do the four basic math operators (=+=,
  =-=, =*=, =/=) work as you might expect?

  How about when the number of operands
  - is greater than two?
  - is less than two (i.e., one or zero)?

  This is a good time to mention that functions with arity /n/ for /n/ = 1
  (unary) and /n/ = 2 (binary) have alternate type names, as does a generic
  classification for /n/ > 2:

  | Arity | Type     |
  |-------+----------|
  |     1 | Monadic  |
  |     2 | Dyadic   |
  |   > 2 | Polyadic |

  Argue for /polyadic/ to mean having /arbitrary arity/ (taking 0 /or more/
  arguments).
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WGP
  Important: see Exercise TER for context.
#+begin_note
  The =morphify= function already exists by the name =mapcar=, and there are
  several variations and embodiments of this /map/ feature, as you will learn
  (and one of which you have already seen --- where?).

  Write a short (one-line body) lisp function named /vector-to-string/
  that takes a vector of symbols and converts it into a single string of the
  symbols\rsquo{} names separated by a space. for example,

#+BEGIN_SRC emacs-lisp
  (format "%s" (vector-to-string [a b c]))
#+END_SRC

  should give

: "a b c"

:HINT:
  - Hint ::
#+BEGIN_SRC emacs-lisp
  (let ((info '(("harry" male 42)
                ("larry" male 31)
                ("curly" male 29)
                ("shirley" female 30))))
    (mapconcat 'first info "\n"))
#+END_SRC
:END:
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WGW *
#+begin_note
  Prefix notation takes some getting used to. Converting an expression from
  prefix to infix, to make arithmetic look more \ldquo{}natural\rdquo, is as easy as
  swapping the first two elements of a three-element list; e.g., =(+ 1 2)=
  becomes =(1 + 2)=. But what if the expression has other expressions nested
  within it, e.g., =(- 10 (* 2 3))=, where one (or both) of the operands is
  another 3-element (prefix expression) list? Recursively applying the swapping
  rule is the answer!

  Study the =prefix->infix= function and the three sample calls to it. Describe
  how it works. Try it on more complex expressions. Re-implement it without
  using =let= or =cond= (use =if=).
#+BEGIN_SRC emacs-lisp :results silent
  (defun prefix->infix (pre)
    (cond ((listp pre)
           (or (= 3 (length pre)) (error "not a 3-length list"))
           (let ((operator (nth 0 pre))
                 (operand1 (nth 1 pre))
                 (operand2 (nth 2 pre)))
             (list (prefix->infix operand1)
                   operator
                   (prefix->infix operand2))))
          (t pre)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
  (prefix->infix '(+ 1 2))
#+END_SRC

: (1 + 2)

#+BEGIN_SRC emacs-lisp :results raw
  (prefix->infix '(+ 1 (* 2 3)))
#+END_SRC

: (1 + (2 * 3))

#+BEGIN_SRC emacs-lisp :results raw
  (prefix->infix '(+ (/ 1 4) (* 2 3)))
#+END_SRC

: ((1 / 4) + (2 * 3))
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO TFV *
#+begin_note
  Implement and test an =infix->prefix= function.
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WJS
#+begin_note
  Describe an analogous situation to floor when taking the ceiling of negative
  numbers.
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WKC
#+begin_note
  Define the \ldquo{}take the fractional part of\rdquo function =frac-part= in terms of
  =floor= as follows:

#+BEGIN_SRC emacs-lisp :results silent
  (defun frac-part (number)
    (- number (floor number)))
#+END_SRC

  For example,
#+BEGIN_SRC emacs-lisp
  (frac-part 3.14159)
#+END_SRC

: 0.14158999999999988

  Suppose =frac-part= were the primitive, built-in function. How would you
  define =floor= (assuming it were /not/ built-in) using =frac-part=?
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WNW
#+begin_note
  What conditions/restrictions on a function must be placed for it to be
  /invertible/ (have an inverse)?
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO TMZ
#+begin_note
  Write elisp with loops and lambda predicates to answer the following:
  1. How many pairs of numbers between 1 and 1000 pass the predicate given by
     the following lambda expression? (lambda (m n) (= 1 (gcd m n)))
  2. How many solutions are there in integers to the equation 3x + 4y = 7?
  3. Each taken from the set [2 3 4 5 6 7 8 9], how many pairs of numbers are
     there that when multiplied together equal one more than a multiple of 11?
  4. How many pairs of numbers that when multiplied together equal one more than
     a multiple of 23 are found in the set [2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
     17 18 19 20 21]?
  5. How many pairs of numbers that when multiplied together equal one more than
     a multiple of *9* are found in the set [2 3 4 5 6 7]?
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO TNL
#+begin_note
  Explore the counterpart of \Sigma, the symbol used to collapse a /sum/ of terms;
  namely, the Greek letter (which?) used to collapse a /product/ of terms.
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO WRD
#+begin_note
  With at least two examples of a binary function, verify the nested summation
  interchange rule.
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
** TODO TNQ
#+begin_note
  Consider the following function:

#+BEGIN_SRC emacs-lisp :results silent
  (defun calculate-pi-very-slowly (max-iterations)
    (* 4 (loop for n from 0 to max-iterations
               sum (/ 1.0 (* (+ (* 2 n) 1) (expt -1 n))))))
#+END_SRC

  How slow is \ldquo{}very slowly\rdquo?
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
* Puzzles
** TODO TEU
#+begin_note
  How many numbers between one and a million contain the digit 1 exactly once,
  and the sum of the rest of the digits is 16? Write elisp code with and without
  loops to verify your answer.
#+end_note
*** Rephrase
*** Approach
*** Solution
*** Proof
** TODO TME
#+begin_note
  Sequences can be non-numeric as well. What is the pattern for this sequence?
: [m b w y me be wi yo met bew ith you meta bewi thyo uati metap bewit hyoua tirel]
  How long can it continue?
#+end_note
*** Rephrase
*** Approach
*** Solution
*** Proof

** TODO WRA
#+begin_note
  Why is the sum of the reciprocals of the powers of two scaled by which power
  equal to two?
#+end_note
*** Rephrase
*** Approach
*** Solution
*** Proof
* DONE Identify Collaborators
  CLOSED: [2018-05-12 Sat 18:06]
  Identify your collaborators and the contribution of each, in the following way:

  - Joseph Smith :: In particular, he helped me understand \dots.
  - Benjamin Franklin :: He helped brainstorm ideas for \dots. 
  -  :: etc. 

Cc: This <Hi>
